MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lpuart.h
/** @defgroup LPUART_LL_EC_DMA_REG_DATA DMA Register Data
  * @{
  */
#define LL_LPUART_DMA_REG_DATA_TRANSMIT    0x00000000U    /*!< Get address of data register used for transmission */
#define LL_LPUART_DMA_REG_DATA_RECEIVE     0x00000001U    /*!< Get address of data register used for reception */
/**
  * @}
  */

/** @defgroup LPUART_LL_EC_REQUEST Request
  * @{
  */
#define LL_LPUART_REQUEST_SEND_BREAK        USART_RQR_SBKRQ     /*!< Send break request           */
#define LL_LPUART_REQUEST_MUTE_MODE         USART_RQR_MMRQ      /*!< Mute mode request            */
#define LL_LPUART_REQUEST_RXDATA_FLUSH      USART_RQR_RXFRQ     /*!< Receive data flush request   */
#define LL_LPUART_REQUEST_TXDATA_FLUSH      USART_RQR_TXFRQ     /*!< Transmit data flush request  */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macros ------------------------------------------------------------*/
/** @defgroup LPUART_LL_Exported_Macros LL LPUART Macros
  * @{
  */

/** @defgroup LPUART_LL_EM_WRITE_READ Common register Write and Read Macros
  * @{
  */

/**
  * @brief  Write a value in LPUART register.
  * @param  instance LPUART Instance
  * @param  reg Register to be written
  * @param  value Value to be written in the register
  */
#define LL_LPUART_WRITE_REG(instance, reg, value) STM32_WRITE_REG((instance)->reg, (value))

/**
  * @brief  Read a value in LPUART register.
  * @param  instance LPUART Instance
  * @param  reg Register to be read
  * @retval Register value
  */
#define LL_LPUART_READ_REG(instance, reg) STM32_READ_REG((instance)->reg)
/**
  * @}
  */

/** @defgroup LPUART_LL_EM_Exported_Macros_Helper Helper Macros
  * @{
  */

/**
  * @brief  Compute LPUARTDIV value according to peripheral clock and
  *         expected baud rate (20-bit value of LPUARTDIV is returned).
  * @param  periph_clock Peripheral clock frequency used for LPUART instance
  * @param  prescaler This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_PRESCALER_DIV1
  *         @arg @ref LL_LPUART_PRESCALER_DIV2
  *         @arg @ref LL_LPUART_PRESCALER_DIV4
  *         @arg @ref LL_LPUART_PRESCALER_DIV6
  *         @arg @ref LL_LPUART_PRESCALER_DIV8
  *         @arg @ref LL_LPUART_PRESCALER_DIV10
  *         @arg @ref LL_LPUART_PRESCALER_DIV12
  *         @arg @ref LL_LPUART_PRESCALER_DIV16
  *         @arg @ref LL_LPUART_PRESCALER_DIV32
  *         @arg @ref LL_LPUART_PRESCALER_DIV64
  *         @arg @ref LL_LPUART_PRESCALER_DIV128
  *         @arg @ref LL_LPUART_PRESCALER_DIV256
  * @param  baudrate Baud rate value to achieve
  * @retval LPUARTDIV value to be used for BRR register filling
  */
__STATIC_INLINE uint32_t LL_LPUART_DIV(uint32_t periph_clock, uint32_t prescaler, uint32_t baudrate)
{
  return (uint32_t)((((((uint64_t)(periph_clock) / (uint64_t)(LL_LPUART_PRESCALER_TAB[(uint16_t)(prescaler)]))
                       * LL_LPUART_LPUARTDIV_FREQ_MUL) + (uint32_t)((baudrate) / 2U))
                     / (baudrate)) & LL_LPUART_BRR_MASK);
}

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @defgroup LPUART_LL_Exported_Functions LL LPUART Functions
  * @{
  */

/** @defgroup LPUART_LL_EF_Configuration Configuration functions
  * @{
  */

/**
  * @brief  LPUART enable.
  * @rmtoll
  *  CR1          UE            LL_LPUART_Enable
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_Enable(USART_TypeDef *p_lpuart)
{
  STM32_SET_BIT(p_lpuart->CR1, USART_CR1_UE);
}

/**
  * @brief  LPUART disable.
  * @rmtoll
  *  CR1          UE            LL_LPUART_Disable
  * @param  p_lpuart LPUART Instance
  * @note   When LPUART is disabled, LPUART prescalers and outputs are stopped immediately,
  *         and current operations are discarded. The configuration of the LPUART is kept, but all the status
  *         flags, in the LPUARTx_ISR are set to their default values.
  * @note   In order to go into low-power mode without generating errors on the line,
  *         the TE bit must be reset before and the software must wait
  *         for the TC bit in the LPUART_ISR to be set before resetting the UE bit.
  *         The DMA requests are also reset when UE = 0 so the DMA channel must
  *         be disabled before resetting the UE bit.
  */
__STATIC_INLINE void LL_LPUART_Disable(USART_TypeDef *p_lpuart)
{
  STM32_CLEAR_BIT(p_lpuart->CR1, USART_CR1_UE);
}

/**
  * @brief  Indicate if LPUART is enabled.
  * @rmtoll
  *  CR1          UE            LL_LPUART_IsEnabled
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabled(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_UE) == (USART_CR1_UE)) ? 1UL : 0UL);
}

/**
  * @brief  FIFO mode enable.
  * @rmtoll
  *  CR1          FIFOEN        LL_LPUART_EnableFIFO
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableFIFO(USART_TypeDef *p_lpuart)
{
  STM32_SET_BIT(p_lpuart->CR1, USART_CR1_FIFOEN);
}

/**
  * @brief  FIFO mode disable.
  * @rmtoll
  *  CR1          FIFOEN        LL_LPUART_DisableFIFO
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableFIFO(USART_TypeDef *p_lpuart)
{
  STM32_CLEAR_BIT(p_lpuart->CR1, USART_CR1_FIFOEN);
}

/**
  * @brief  Indicate if FIFO mode is enabled.
  * @rmtoll
  *  CR1          FIFOEN        LL_LPUART_IsEnabledFIFO
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledFIFO(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_FIFOEN) == (USART_CR1_FIFOEN)) ? 1UL : 0UL);
}

/**
  * @brief  Configure TX FIFO threshold.
  * @rmtoll
  *  CR3          TXFTCFG       LL_LPUART_SetTXFIFOThreshold
  * @param  p_lpuart LPUART Instance
  * @param  threshold This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_8_8
  */
__STATIC_INLINE void LL_LPUART_SetTXFIFOThreshold(USART_TypeDef *p_lpuart, uint32_t threshold)
{
  STM32_ATOMIC_MODIFY_REG_32(p_lpuart->CR3, USART_CR3_TXFTCFG, threshold << USART_CR3_TXFTCFG_Pos);
}

/**
  * @brief  Return TX FIFO threshold configuration.
  * @rmtoll
  *  CR3          TXFTCFG       LL_LPUART_GetTXFIFOThreshold
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_8_8
  */
__STATIC_INLINE uint32_t LL_LPUART_GetTXFIFOThreshold(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR3, USART_CR3_TXFTCFG) >> USART_CR3_TXFTCFG_Pos);
}

/**
  * @brief  Configure RX FIFO threshold.
  * @rmtoll
  *  CR3          RXFTCFG       LL_LPUART_SetRXFIFOThreshold
  * @param  p_lpuart LPUART Instance
  * @param  threshold This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_8_8
  */
__STATIC_INLINE void LL_LPUART_SetRXFIFOThreshold(USART_TypeDef *p_lpuart, uint32_t threshold)
{
  STM32_ATOMIC_MODIFY_REG_32(p_lpuart->CR3, USART_CR3_RXFTCFG, threshold << USART_CR3_RXFTCFG_Pos);
}

/**
  * @brief  Return RX FIFO threshold configuration.
  * @rmtoll
  *  CR3          RXFTCFG       LL_LPUART_GetRXFIFOThreshold
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_8_8
  */
__STATIC_INLINE uint32_t LL_LPUART_GetRXFIFOThreshold(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR3, USART_CR3_RXFTCFG) >> USART_CR3_RXFTCFG_Pos);
}

/**
  * @brief  Configure TX and RX FIFOs threshold.
  * @rmtoll
  *  CR3          TXFTCFG       LL_LPUART_ConfigFIFOsThreshold \n
  *  CR3          RXFTCFG       LL_LPUART_ConfigFIFOsThreshold
  * @param  p_lpuart LPUART Instance
  * @param  tx_threshold This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_8_8
  * @param  rx_threshold This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_1_2
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_3_4
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_7_8
  *         @arg @ref LL_LPUART_FIFO_THRESHOLD_8_8
  */
__STATIC_INLINE void LL_LPUART_ConfigFIFOsThreshold(USART_TypeDef *p_lpuart, uint32_t tx_threshold,
                                                    uint32_t rx_threshold)
{
  STM32_ATOMIC_MODIFY_REG_32(p_lpuart->CR3, USART_CR3_TXFTCFG | USART_CR3_RXFTCFG,
                             (tx_threshold << USART_CR3_TXFTCFG_Pos) | (rx_threshold << USART_CR3_RXFTCFG_Pos));
}

/**
  * @brief  LPUART enabled in stop mode.
  * @rmtoll
  *  CR1          UESM          LL_LPUART_EnableInStopMode
  * @param  p_lpuart LPUART Instance
  * @note   When this function is enabled, LPUART is able to wake up the MCU from stop mode, provided that
  *         LPUART clock selection is HSI or LSE in RCC.
  */
__STATIC_INLINE void LL_LPUART_EnableInStopMode(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_UESM);
}

/**
  * @brief  LPUART disabled in stop mode.
  * @rmtoll
  *  CR1          UESM          LL_LPUART_DisableInStopMode
  * @param  p_lpuart LPUART Instance
  * @note   When this function is disabled, LPUART is not able to wake up the MCU from stop mode
  */
__STATIC_INLINE void LL_LPUART_DisableInStopMode(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_UESM);
}

/**
  * @brief  Indicate if LPUART is enabled in stop mode
  *         (able to wake up MCU from stop mode or not).
  * @rmtoll
  *  CR1          UESM          LL_LPUART_IsEnabledInStopMode
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledInStopMode(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_UESM) == (USART_CR1_UESM)) ? 1UL : 0UL);
}


/**
  * @brief  Configure the LPUART instance.
  * @rmtoll
  *  CR1         M0             LL_LPUART_ConfigXfer \n
  *  CR1         M1             LL_LPUART_ConfigXfer \n
  *  CR1         PCE            LL_LPUART_ConfigXfer \n
  *  CR1         PS             LL_LPUART_ConfigXfer \n
  *  CR1         TE             LL_LPUART_ConfigXfer \n
  *  CR1         RE             LL_LPUART_ConfigXfer \n
  *  CR2         STOP_0         LL_LPUART_ConfigXfer \n
  *  CR2         STOP_1         LL_LPUART_ConfigXfer
  * @param  p_lpuart LPUART Instance
  * @param cr1_config: This parameter must be a combination of the following groups:
  *         @arg @ref USART_LL_EC_DATAWIDTH
  *         @arg @ref USART_LL_EC_PARITY
  *         @arg @ref USART_LL_EC_DIRECTION
  * @param cr2_config: This parameter must be a combination of the following groups:
  *         @arg @ref USART_LL_EC_STOPBITS
  */
__STATIC_INLINE void LL_LPUART_ConfigXfer(USART_TypeDef *p_lpuart, uint32_t cr1_config, uint32_t cr2_config)
{
  STM32_MODIFY_REG(p_lpuart->CR1, (USART_CR1_M0 | USART_CR1_M1 | USART_CR1_PCE | USART_CR1_PS | USART_CR1_TE
                                   | USART_CR1_RE), cr1_config);

