MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lpuart.h
  STM32_MODIFY_REG(p_lpuart->CR2, (USART_CR2_STOP_0 | USART_CR2_STOP_1), cr2_config);
}

/**
  * @brief  Receiver enable (receiver is enabled and begins searching for a start bit).
  * @rmtoll
  *  CR1          RE            LL_LPUART_EnableDirectionRx
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableDirectionRx(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_RE);
}

/**
  * @brief  Receiver disable.
  * @rmtoll
  *  CR1          RE            LL_LPUART_DisableDirectionRx
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableDirectionRx(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_RE);
}

/**
  * @brief  Indicate if the p_lpuart receiver is enabled.
  * @rmtoll
  *  CR1          RE            LL_LPUART_IsEnabledDirectionRx
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledDirectionRx(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR1, USART_CR1_RE) == (USART_CR1_RE));
}

/**
  * @brief  Transmitter enable.
  * @rmtoll
  *  CR1          TE            LL_LPUART_EnableDirectionTx
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableDirectionTx(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_TE);
}

/**
  * @brief  Transmitter disable.
  * @rmtoll
  *  CR1          TE            LL_LPUART_DisableDirectionTx
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableDirectionTx(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_TE);
}

/**
  * @brief  Indicate if the p_lpuart transmitter is enabled.
  * @rmtoll
  *  CR1          TE            LL_LPUART_IsEnabledDirectionTx
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledDirectionTx(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR1, USART_CR1_TE) == (USART_CR1_TE));
}

/**
  * @brief  Configure simultaneously enabled/disabled states
  *         of transmitter and receiver.
  * @rmtoll
  *  CR1          RE            LL_LPUART_SetTransferDirection \n
  *  CR1          TE            LL_LPUART_SetTransferDirection
  * @param  p_lpuart LPUART Instance
  * @param  transfer_direction This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_DIRECTION_NONE
  *         @arg @ref LL_LPUART_DIRECTION_RX
  *         @arg @ref LL_LPUART_DIRECTION_TX
  *         @arg @ref LL_LPUART_DIRECTION_TX_RX
  */
__STATIC_INLINE void LL_LPUART_SetTransferDirection(USART_TypeDef *p_lpuart, uint32_t transfer_direction)
{
  STM32_ATOMIC_MODIFY_REG_32(p_lpuart->CR1, USART_CR1_RE | USART_CR1_TE, transfer_direction);
}

/**
  * @brief  Return enabled/disabled states of transmitter and receiver.
  * @rmtoll
  *  CR1          RE            LL_LPUART_GetTransferDirection \n
  *  CR1          TE            LL_LPUART_GetTransferDirection
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_DIRECTION_NONE
  *         @arg @ref LL_LPUART_DIRECTION_RX
  *         @arg @ref LL_LPUART_DIRECTION_TX
  *         @arg @ref LL_LPUART_DIRECTION_TX_RX
  */
__STATIC_INLINE uint32_t LL_LPUART_GetTransferDirection(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR1, USART_CR1_RE | USART_CR1_TE));
}

/**
  * @brief  Configure parity (enabled/disabled and parity mode if enabled).
  * @rmtoll
  *  CR1          PS            LL_LPUART_SetParity \n
  *  CR1          PCE           LL_LPUART_SetParity
  * @param  p_lpuart LPUART Instance
  * @param  parity This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_PARITY_NONE
  *         @arg @ref LL_LPUART_PARITY_EVEN
  *         @arg @ref LL_LPUART_PARITY_ODD
  * @note   This function selects if hardware parity control (generation and detection) is enabled or disabled.
  *         When the parity control is enabled (Odd or Even), computed parity bit is inserted at the MSB position
  *         (depending on data width) and parity is checked on the received data.
  */
__STATIC_INLINE void LL_LPUART_SetParity(USART_TypeDef *p_lpuart, uint32_t parity)
{
  STM32_MODIFY_REG(p_lpuart->CR1, USART_CR1_PS | USART_CR1_PCE, parity);
}

/**
  * @brief  Return parity configuration (enabled/disabled and parity mode if enabled).
  * @rmtoll
  *  CR1          PS            LL_LPUART_GetParity \n
  *  CR1          PCE           LL_LPUART_GetParity
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_PARITY_NONE
  *         @arg @ref LL_LPUART_PARITY_EVEN
  *         @arg @ref LL_LPUART_PARITY_ODD
  */
__STATIC_INLINE uint32_t LL_LPUART_GetParity(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR1, USART_CR1_PS | USART_CR1_PCE));
}

/**
  * @brief  Set receiver wake-up method from mute mode.
  * @rmtoll
  *  CR1          WAKE          LL_LPUART_SetWakeUpMethod
  * @param  p_lpuart LPUART Instance
  * @param  method This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_WAKEUP_IDLELINE
  *         @arg @ref LL_LPUART_WAKEUP_ADDRESSMARK
  */
__STATIC_INLINE void LL_LPUART_SetWakeUpMethod(USART_TypeDef *p_lpuart, uint32_t method)
{
  STM32_MODIFY_REG(p_lpuart->CR1, USART_CR1_WAKE, method);
}

/**
  * @brief  Return receiver wake-up method from mute mode.
  * @rmtoll
  *  CR1          WAKE          LL_LPUART_GetWakeUpMethod
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_WAKEUP_IDLELINE
  *         @arg @ref LL_LPUART_WAKEUP_ADDRESSMARK
  */
__STATIC_INLINE uint32_t LL_LPUART_GetWakeUpMethod(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR1, USART_CR1_WAKE));
}

/**
  * @brief  Set word length (nb of data bits, excluding start and stop bits).
  * @rmtoll
  *  CR1          M             LL_LPUART_SetDataWidth
  * @param  p_lpuart LPUART Instance
  * @param  data_width This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_DATAWIDTH_7_BIT
  *         @arg @ref LL_LPUART_DATAWIDTH_8_BIT
  *         @arg @ref LL_LPUART_DATAWIDTH_9_BIT
  */
__STATIC_INLINE void LL_LPUART_SetDataWidth(USART_TypeDef *p_lpuart, uint32_t data_width)
{
  STM32_MODIFY_REG(p_lpuart->CR1, USART_CR1_M, data_width);
}

/**
  * @brief  Return word length (i.e. nb of data bits, excluding start and stop bits).
  * @rmtoll
  *  CR1          M             LL_LPUART_GetDataWidth
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_DATAWIDTH_7_BIT
  *         @arg @ref LL_LPUART_DATAWIDTH_8_BIT
  *         @arg @ref LL_LPUART_DATAWIDTH_9_BIT
  */
__STATIC_INLINE uint32_t LL_LPUART_GetDataWidth(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR1, USART_CR1_M));
}

/**
  * @brief  Allow switching between mute mode and active mode.
  * @rmtoll
  *  CR1          MME           LL_LPUART_EnableMuteMode
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableMuteMode(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_MME);
}

/**
  * @brief  Prevent mute mode use. Set receiver in active mode permanently.
  * @rmtoll
  *  CR1          MME           LL_LPUART_DisableMuteMode
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableMuteMode(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_MME);
}

/**
  * @brief  Indicate if switching between mute mode and active mode is allowed.
  * @rmtoll
  *  CR1          MME           LL_LPUART_IsEnabledMuteMode
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledMuteMode(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_MME) == (USART_CR1_MME)) ? 1UL : 0UL);
}

/**
  * @brief  Configure clock source prescaler for baud rate generator and oversampling.
  * @rmtoll
  *  PRESC        PRESCALER     LL_LPUART_SetPrescaler
  * @param  p_lpuart LPUART Instance
  * @param  prescaler_value This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_PRESCALER_DIV1
  *         @arg @ref LL_LPUART_PRESCALER_DIV2
  *         @arg @ref LL_LPUART_PRESCALER_DIV4
  *         @arg @ref LL_LPUART_PRESCALER_DIV6
  *         @arg @ref LL_LPUART_PRESCALER_DIV8
  *         @arg @ref LL_LPUART_PRESCALER_DIV10
  *         @arg @ref LL_LPUART_PRESCALER_DIV12
  *         @arg @ref LL_LPUART_PRESCALER_DIV16
  *         @arg @ref LL_LPUART_PRESCALER_DIV32
  *         @arg @ref LL_LPUART_PRESCALER_DIV64
  *         @arg @ref LL_LPUART_PRESCALER_DIV128
  *         @arg @ref LL_LPUART_PRESCALER_DIV256
  */
__STATIC_INLINE void LL_LPUART_SetPrescaler(USART_TypeDef *p_lpuart, uint32_t prescaler_value)
{
  STM32_MODIFY_REG(p_lpuart->PRESC, USART_PRESC_PRESCALER, (uint16_t)prescaler_value);
}

/**
  * @brief  Retrieve the clock source prescaler for baud rate generator and oversampling.
  * @rmtoll
  *  PRESC        PRESCALER     LL_LPUART_GetPrescaler
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_PRESCALER_DIV1
  *         @arg @ref LL_LPUART_PRESCALER_DIV2
  *         @arg @ref LL_LPUART_PRESCALER_DIV4
  *         @arg @ref LL_LPUART_PRESCALER_DIV6
  *         @arg @ref LL_LPUART_PRESCALER_DIV8
  *         @arg @ref LL_LPUART_PRESCALER_DIV10
  *         @arg @ref LL_LPUART_PRESCALER_DIV12
  *         @arg @ref LL_LPUART_PRESCALER_DIV16
  *         @arg @ref LL_LPUART_PRESCALER_DIV32
  *         @arg @ref LL_LPUART_PRESCALER_DIV64
  *         @arg @ref LL_LPUART_PRESCALER_DIV128
  *         @arg @ref LL_LPUART_PRESCALER_DIV256
  */
__STATIC_INLINE uint32_t LL_LPUART_GetPrescaler(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->PRESC, USART_PRESC_PRESCALER));
}

/**
  * @brief  Set the length of the stop bits.
  * @rmtoll
  *  CR2          STOP          LL_LPUART_SetStopBitsLength
  * @param  p_lpuart LPUART Instance
  * @param  stop_bits This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_STOP_BIT_1
  *         @arg @ref LL_LPUART_STOP_BIT_2
  */
__STATIC_INLINE void LL_LPUART_SetStopBitsLength(USART_TypeDef *p_lpuart, uint32_t stop_bits)
{
  STM32_MODIFY_REG(p_lpuart->CR2, USART_CR2_STOP, stop_bits);
}

/**
  * @brief  Retrieve the length of the stop bits.
  * @rmtoll
  *  CR2          STOP          LL_LPUART_GetStopBitsLength
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_STOP_BIT_1
  *         @arg @ref LL_LPUART_STOP_BIT_2
  */
__STATIC_INLINE uint32_t LL_LPUART_GetStopBitsLength(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR2, USART_CR2_STOP));
}

/**
  * @brief  Configure character frame format (datawidth, parity control, stop bits).
  * @rmtoll
  *  CR1          PS            LL_LPUART_ConfigCharacter \n
  *  CR1          PCE           LL_LPUART_ConfigCharacter \n
  *  CR1          M             LL_LPUART_ConfigCharacter \n
  *  CR2          STOP          LL_LPUART_ConfigCharacter
  * @param  p_lpuart LPUART Instance
  * @param  data_width This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_DATAWIDTH_7_BIT
  *         @arg @ref LL_LPUART_DATAWIDTH_8_BIT
  *         @arg @ref LL_LPUART_DATAWIDTH_9_BIT
  * @param  parity This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_PARITY_NONE
  *         @arg @ref LL_LPUART_PARITY_EVEN
  *         @arg @ref LL_LPUART_PARITY_ODD
  * @param  stop_bits This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_STOP_BIT_1
  *         @arg @ref LL_LPUART_STOP_BIT_2
  * @note   Call of this function is equivalent to the following function call sequence:
  *         - Data Width configuration using @ref LL_LPUART_SetDataWidth() function
  *         - Parity Control and mode configuration using @ref LL_LPUART_SetParity() function
  *         - Stop bits configuration using @ref LL_LPUART_SetStopBitsLength() function
  */
__STATIC_INLINE void LL_LPUART_ConfigCharacter(USART_TypeDef *p_lpuart, uint32_t data_width, uint32_t parity,
                                               uint32_t stop_bits)
{
  STM32_MODIFY_REG(p_lpuart->CR1, USART_CR1_PS | USART_CR1_PCE | USART_CR1_M, parity | data_width);
  STM32_MODIFY_REG(p_lpuart->CR2, USART_CR2_STOP, stop_bits);
}

/**
  * @brief  Configure TX/RX pin swapping setting.
  * @rmtoll
  *  CR2          SWAP          LL_LPUART_SetTXRXSwap
  * @param  p_lpuart LPUART Instance
  * @param  swap_config This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_TXRX_STANDARD
  *         @arg @ref LL_LPUART_TXRX_SWAPPED
  */
__STATIC_INLINE void LL_LPUART_SetTXRXSwap(USART_TypeDef *p_lpuart, uint32_t swap_config)
{
  STM32_MODIFY_REG(p_lpuart->CR2, USART_CR2_SWAP, swap_config);
}

/**
  * @brief  Retrieve TX/RX pin swapping configuration.
  * @rmtoll
  *  CR2          SWAP          LL_LPUART_GetTXRXSwap
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_TXRX_STANDARD
  *         @arg @ref LL_LPUART_TXRX_SWAPPED
  */
__STATIC_INLINE uint32_t LL_LPUART_GetTXRXSwap(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR2, USART_CR2_SWAP));
}

/**
  * @brief  Configure RX pin active level logic.
  * @rmtoll
  *  CR2          RXINV         LL_LPUART_SetRXPinLevel
  * @param  p_lpuart LPUART Instance
  * @param  pin_inv_method This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_RXPIN_LEVEL_STANDARD
  *         @arg @ref LL_LPUART_RXPIN_LEVEL_INVERTED
  */
__STATIC_INLINE void LL_LPUART_SetRXPinLevel(USART_TypeDef *p_lpuart, uint32_t pin_inv_method)
{
  STM32_MODIFY_REG(p_lpuart->CR2, USART_CR2_RXINV, pin_inv_method);
}

/**
  * @brief  Retrieve RX pin active level logic configuration.
  * @rmtoll
  *  CR2          RXINV         LL_LPUART_GetRXPinLevel
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_RXPIN_LEVEL_STANDARD
  *         @arg @ref LL_LPUART_RXPIN_LEVEL_INVERTED
  */
__STATIC_INLINE uint32_t LL_LPUART_GetRXPinLevel(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR2, USART_CR2_RXINV));
}

/**
  * @brief  Configure TX pin active level logic.
  * @rmtoll
  *  CR2          TXINV         LL_LPUART_SetTXPinLevel
  * @param  p_lpuart LPUART Instance
  * @param  pin_inv_method This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_TXPIN_LEVEL_STANDARD
  *         @arg @ref LL_LPUART_TXPIN_LEVEL_INVERTED
  */
__STATIC_INLINE void LL_LPUART_SetTXPinLevel(USART_TypeDef *p_lpuart, uint32_t pin_inv_method)
{
  STM32_MODIFY_REG(p_lpuart->CR2, USART_CR2_TXINV, pin_inv_method);
}

/**
  * @brief  Retrieve TX pin active level logic configuration.
  * @rmtoll
  *  CR2          TXINV         LL_LPUART_GetTXPinLevel
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_TXPIN_LEVEL_STANDARD
  *         @arg @ref LL_LPUART_TXPIN_LEVEL_INVERTED
  */
__STATIC_INLINE uint32_t LL_LPUART_GetTXPinLevel(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR2, USART_CR2_TXINV));
}

/**
  * @brief  Configure binary data logic.
  *
  * @rmtoll
  *  CR2          DATAINV       LL_LPUART_SetBinaryDataLogic
  * @param  p_lpuart LPUART Instance
  * @param  data_logic This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_BINARY_LOGIC_POSITIVE
  *         @arg @ref LL_LPUART_BINARY_LOGIC_NEGATIVE
  * @note   Allow to define how Logical data from the data register are send/received :
  *         either in positive/direct logic (1=H, 0=L) or in negative/inverse logic (1=L, 0=H)
  */
__STATIC_INLINE void LL_LPUART_SetBinaryDataLogic(USART_TypeDef *p_lpuart, uint32_t data_logic)
{
  STM32_MODIFY_REG(p_lpuart->CR2, USART_CR2_DATAINV, data_logic);
}

/**
  * @brief  Retrieve binary data configuration.
  * @rmtoll
  *  CR2          DATAINV       LL_LPUART_GetBinaryDataLogic
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_BINARY_LOGIC_POSITIVE
  *         @arg @ref LL_LPUART_BINARY_LOGIC_NEGATIVE
  */
__STATIC_INLINE uint32_t LL_LPUART_GetBinaryDataLogic(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR2, USART_CR2_DATAINV));
}

/**
  * @brief  Configure transfer bit order (either less or most significant bit first).
  * @rmtoll
  *  CR2          MSBFIRST      LL_LPUART_SetTransferBitOrder
  * @param  p_lpuart LPUART Instance
  * @param  bit_order This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_BITORDER_LSBFIRST
  *         @arg @ref LL_LPUART_BITORDER_MSBFIRST
  * @note   MSB-first means data is transmitted/received with the MSB first, following the start bit.
  *         LSB-first means data is transmitted/received with data bit 0 first, following the start bit.
  */
__STATIC_INLINE void LL_LPUART_SetTransferBitOrder(USART_TypeDef *p_lpuart, uint32_t bit_order)
{
  STM32_MODIFY_REG(p_lpuart->CR2, USART_CR2_MSBFIRST, bit_order);
}

/**
  * @brief  Return transfer bit order (either less or most significant bit first).
  * @rmtoll
  *  CR2          MSBFIRST      LL_LPUART_GetTransferBitOrder
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_BITORDER_LSBFIRST
  *         @arg @ref LL_LPUART_BITORDER_MSBFIRST
  * @note   MSB-first means data is transmitted/received with the MSB first, following the start bit.
  *         LSB-first means data is transmitted/received with data bit 0 first, following the start bit.
  */
__STATIC_INLINE uint32_t LL_LPUART_GetTransferBitOrder(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR2, USART_CR2_MSBFIRST));
}

/**
  * @brief  Set an 8-bit address of the LPUART node as set in ADD field of CR2.
  * @rmtoll
  *  CR2          ADD           LL_LPUART_SetNodeAddress
  * @param  p_lpuart LPUART Instance
  * @param  node_address 4-bit or 7-bit address of the LPUART node.
  * @note   If 4-bit Address Detection is selected in ADDM7,
  *         only 4 bits (b3-b0) of returned value are relevant (b31-b4 are not relevant).
  *         If 7-bit Address Detection is selected in ADDM7,
  *         only 8 bits (b7-b0) of returned value are relevant (b31-b8 are not relevant).
  */
__STATIC_INLINE void LL_LPUART_SetNodeAddress(USART_TypeDef *p_lpuart, uint32_t node_address)
{
  STM32_MODIFY_REG(p_lpuart->CR2, USART_CR2_ADD, (node_address << USART_CR2_ADD_Pos));
}

/**
  * @brief  Return 8-bit address of the LPUART node as set in ADD field of CR2.
  * @rmtoll
  *  CR2          ADD           LL_LPUART_GetNodeAddress
  * @param  p_lpuart LPUART Instance
  * @note   If 4-bit Address Detection is selected in ADDM7,
  *         only 4 bits (b3-b0) of returned value are relevant (b31-b4 are not relevant).
  *         If 7-bit Address Detection is selected in ADDM7,
  *         only 8 bits (b7-b0) of returned value are relevant (b31-b8 are not relevant).
  * @retval Address of the LPUART node (value between Min_Data=0 and Max_Data=255).
  */
__STATIC_INLINE uint32_t LL_LPUART_GetNodeAddress(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR2, USART_CR2_ADD) >> USART_CR2_ADD_Pos);
}

/**
  * @brief  Set the address length of the LPUART node in ADDM7 field of CR2.
  * @rmtoll
  *  CR2          ADDM7           LL_LPUART_SetNodeAddressLength
  * @param  p_lpuart LPUART Instance
  * @param  address_len This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_ADDRESS_DETECT_4_BIT
  *         @arg @ref LL_LPUART_ADDRESS_DETECT_7_BIT
  * @note   If 4-bit Address Detection is selected in ADDM7,
  *         only 4 bits (b3-b0) of node address value are relevant (b7-b4 are not relevant).
  *         If 7-bit Address Detection is selected in ADDM7,
  *         only 8 bits (b7-b0) of node address value are relevant.
  */
__STATIC_INLINE void LL_LPUART_SetNodeAddressLength(USART_TypeDef *p_lpuart, uint32_t address_len)
{
  STM32_MODIFY_REG(p_lpuart->CR2, USART_CR2_ADDM7, address_len);
}

/**
  * @brief  Return length of node address used in address detection mode (7-bit or 4-bit).
  * @rmtoll
  *  CR2          ADDM7         LL_LPUART_GetNodeAddressLength
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_ADDRESS_DETECT_4_BIT
  *         @arg @ref LL_LPUART_ADDRESS_DETECT_7_BIT
  */
__STATIC_INLINE uint32_t LL_LPUART_GetNodeAddressLength(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR2, USART_CR2_ADDM7));
}

/**
  * @brief  Configure address and address length of the LPUART node.
  * @rmtoll
  *  CR2          ADD           LL_LPUART_ConfigNodeAddress \n
  *  CR2          ADDM7         LL_LPUART_ConfigNodeAddress
  * @param  p_lpuart LPUART Instance
  * @param  address_len This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_ADDRESS_DETECT_4_BIT
  *         @arg @ref LL_LPUART_ADDRESS_DETECT_7_BIT
  * @param  node_address 4- or 7-bit address of the LPUART node.
  * @note   This is used in multiprocessor communication during mute mode or stop mode,
  *         for wake-up with address mark detection.
  * @note   4-bit address node is used when 4-bit Address Detection is selected in ADDM7.
  *         (b7-b4 must be set to 0)
  *         8-bit address node is used when 7-bit Address Detection is selected in ADDM7.
  *         (This is used in multiprocessor communication during mute mode or stop mode,
  *         for wake-up with 7-bit address mark detection.
  *         The MSB of the character sent by the transmitter must be equal to 1.
  *         It could also be used for character detection during normal reception,
  *         mute mode inactive (for example, end of block detection in ModBus protocol).
  *         In this case, the whole received character (8-bit) is compared to the ADD[7:0]
  *         value and CMF flag is set on match).
  */
__STATIC_INLINE void LL_LPUART_ConfigNodeAddress(USART_TypeDef *p_lpuart, uint32_t address_len, uint32_t node_address)
{
  STM32_MODIFY_REG(p_lpuart->CR2, USART_CR2_ADD | USART_CR2_ADDM7,
                   (uint32_t)(address_len | (node_address << USART_CR2_ADD_Pos)));
}

/**
  * @brief  Enable RTS HW flow control.
  * @rmtoll
  *  CR3          RTSE          LL_LPUART_EnableRTSHWFlowCtrl
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableRTSHWFlowCtrl(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR3, USART_CR3_RTSE);
}

/**
  * @brief  Disable RTS HW flow control.
  * @rmtoll
  *  CR3          RTSE          LL_LPUART_DisableRTSHWFlowCtrl
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableRTSHWFlowCtrl(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR3, USART_CR3_RTSE);
}

/**
  * @brief  Enable CTS HW flow control.
  * @rmtoll
  *  CR3          CTSE          LL_LPUART_EnableCTSHWFlowCtrl
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableCTSHWFlowCtrl(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR3, USART_CR3_CTSE);
}

