MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lpuart.h
/**
  * @brief  Disable CTS HW flow control.
  * @rmtoll
  *  CR3          CTSE          LL_LPUART_DisableCTSHWFlowCtrl
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableCTSHWFlowCtrl(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR3, USART_CR3_CTSE);
}

/**
  * @brief  Configure HW flow control mode (both CTS and RTS).
  * @rmtoll
  *  CR3          RTSE          LL_LPUART_SetHWFlowCtrl \n
  *  CR3          CTSE          LL_LPUART_SetHWFlowCtrl
  * @param  p_lpuart LPUART Instance
  * @param  hardware_flow_control This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_HWCONTROL_NONE
  *         @arg @ref LL_LPUART_HWCONTROL_RTS
  *         @arg @ref LL_LPUART_HWCONTROL_CTS
  *         @arg @ref LL_LPUART_HWCONTROL_RTS_CTS
  */
__STATIC_INLINE void LL_LPUART_SetHWFlowCtrl(USART_TypeDef *p_lpuart, uint32_t hardware_flow_control)
{
  STM32_MODIFY_REG(p_lpuart->CR3, USART_CR3_RTSE | USART_CR3_CTSE, hardware_flow_control);
}

/**
  * @brief  Return HW flow control configuration (both CTS and RTS).
  * @rmtoll
  *  CR3          RTSE          LL_LPUART_GetHWFlowCtrl \n
  *  CR3          CTSE          LL_LPUART_GetHWFlowCtrl
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_HWCONTROL_NONE
  *         @arg @ref LL_LPUART_HWCONTROL_RTS
  *         @arg @ref LL_LPUART_HWCONTROL_CTS
  *         @arg @ref LL_LPUART_HWCONTROL_RTS_CTS
  */
__STATIC_INLINE uint32_t LL_LPUART_GetHWFlowCtrl(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR3, USART_CR3_RTSE | USART_CR3_CTSE));
}

/**
  * @brief  Enable overrun detection.
  * @rmtoll
  *  CR3          OVRDIS        LL_LPUART_EnableOverrunDetect
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableOverrunDetect(USART_TypeDef *p_lpuart)
{
  STM32_CLEAR_BIT(p_lpuart->CR3, USART_CR3_OVRDIS);
}

/**
  * @brief  Disable overrun detection.
  * @rmtoll
  *  CR3          OVRDIS        LL_LPUART_DisableOverrunDetect
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableOverrunDetect(USART_TypeDef *p_lpuart)
{
  STM32_SET_BIT(p_lpuart->CR3, USART_CR3_OVRDIS);
}

/**
  * @brief  Indicate if overrun detection is enabled.
  * @rmtoll
  *  CR3          OVRDIS        LL_LPUART_IsEnabledOverrunDetect
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledOverrunDetect(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR3, USART_CR3_OVRDIS) != USART_CR3_OVRDIS) ? 1UL : 0UL);
}

/**
  * @brief  Select event type for wake-up interrupt flag (WUS[1:0] bits).
  * @rmtoll
  *  CR3          WUS           LL_LPUART_SetWKUPType
  * @param  p_lpuart LPUART Instance
  * @param  type This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_WAKEUP_ON_ADDRESS
  *         @arg @ref LL_LPUART_WAKEUP_ON_STARTBIT
  *         @arg @ref LL_LPUART_WAKEUP_ON_RXNE
  */
__STATIC_INLINE void LL_LPUART_SetWKUPType(USART_TypeDef *p_lpuart, uint32_t type)
{
  STM32_MODIFY_REG(p_lpuart->CR3, USART_CR3_WUS, type);
}

/**
  * @brief  Return event type for wake-up interrupt flag (WUS[1:0] bits).
  * @rmtoll
  *  CR3          WUS           LL_LPUART_GetWKUPType
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_WAKEUP_ON_ADDRESS
  *         @arg @ref LL_LPUART_WAKEUP_ON_STARTBIT
  *         @arg @ref LL_LPUART_WAKEUP_ON_RXNE
  */
__STATIC_INLINE uint32_t LL_LPUART_GetWKUPType(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR3, USART_CR3_WUS));
}

/**
  * @brief  Configure LPUART BRR register for achieving expected baud rate value.
  * @rmtoll
  *  BRR          BRR           LL_LPUART_SetBaudRate
  * @param  p_lpuart LPUART Instance
  * @param  periph_clk Peripheral Clock
  * @param  prescaler_value This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_PRESCALER_DIV1
  *         @arg @ref LL_LPUART_PRESCALER_DIV2
  *         @arg @ref LL_LPUART_PRESCALER_DIV4
  *         @arg @ref LL_LPUART_PRESCALER_DIV6
  *         @arg @ref LL_LPUART_PRESCALER_DIV8
  *         @arg @ref LL_LPUART_PRESCALER_DIV10
  *         @arg @ref LL_LPUART_PRESCALER_DIV12
  *         @arg @ref LL_LPUART_PRESCALER_DIV16
  *         @arg @ref LL_LPUART_PRESCALER_DIV32
  *         @arg @ref LL_LPUART_PRESCALER_DIV64
  *         @arg @ref LL_LPUART_PRESCALER_DIV128
  *         @arg @ref LL_LPUART_PRESCALER_DIV256
  * @param  baud_rate Baud rate.
  * @note   Compute and set LPUARTDIV value in BRR register (full BRR content)
  *         according to used peripheral clock and expected baud rate values.
  * @note   Peripheral clock and baud rate values provided as function parameters must be valid
  *         (baud rate value != 0).
  * @note   Provided that LPUARTx_BRR must be > = 0x300 and LPUART_BRR is 20-bit,
  *         care must be taken when generating high baud rates using high periph_clk
  *         values. periph_clk must be in the range [3 x baud_rate, 4096 x baud_rate].
  */
__STATIC_INLINE void LL_LPUART_SetBaudRate(USART_TypeDef *p_lpuart, uint32_t periph_clk, uint32_t prescaler_value,
                                           uint32_t baud_rate)
{
  if (baud_rate != 0U)
  {
    p_lpuart->BRR = LL_LPUART_DIV(periph_clk, prescaler_value, baud_rate);
  }
}

/**
  * @brief  Return current baud rate value, according to LPUARTDIV present in BRR register
  *         (full BRR content), and to used peripheral clock values.
  * @rmtoll
  *  BRR          BRR           LL_LPUART_GetBaudRate
  * @param  p_lpuart LPUART Instance
  * @param  periph_clk Peripheral Clock
  * @param  prescaler_value This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_PRESCALER_DIV1
  *         @arg @ref LL_LPUART_PRESCALER_DIV2
  *         @arg @ref LL_LPUART_PRESCALER_DIV4
  *         @arg @ref LL_LPUART_PRESCALER_DIV6
  *         @arg @ref LL_LPUART_PRESCALER_DIV8
  *         @arg @ref LL_LPUART_PRESCALER_DIV10
  *         @arg @ref LL_LPUART_PRESCALER_DIV12
  *         @arg @ref LL_LPUART_PRESCALER_DIV16
  *         @arg @ref LL_LPUART_PRESCALER_DIV32
  *         @arg @ref LL_LPUART_PRESCALER_DIV64
  *         @arg @ref LL_LPUART_PRESCALER_DIV128
  *         @arg @ref LL_LPUART_PRESCALER_DIV256
  * @note   In case of non-initialized or invalid value stored in BRR register, value 0 will be returned.
  * @retval Baud rate
  */
__STATIC_INLINE uint32_t LL_LPUART_GetBaudRate(const USART_TypeDef *p_lpuart, uint32_t periph_clk,
                                               uint32_t prescaler_value)
{
  uint32_t lpuartdiv;
  uint32_t brrresult;
  uint32_t periphclkpresc = (uint32_t)(periph_clk / (LL_LPUART_PRESCALER_TAB[(uint16_t)prescaler_value]));

