MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lpuart.h
  lpuartdiv = p_lpuart->BRR & LL_LPUART_BRR_MASK;

  if (lpuartdiv >= LL_LPUART_BRR_MIN_VALUE)
  {
    brrresult = (uint32_t)(((uint64_t)(periphclkpresc) * LL_LPUART_LPUARTDIV_FREQ_MUL) / lpuartdiv);
  }
  else
  {
    brrresult = 0x0UL;
  }

  return (brrresult);
}

/**
  * @}
  */

/** @defgroup LPUART_LL_EF_Configuration_HalfDuplex Configuration functions related to half duplex feature.
  * @{
  */

/**
  * @brief  Enable single wire half-duplex mode.
  * @rmtoll
  *  CR3          HDSEL         LL_LPUART_EnableHalfDuplex
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableHalfDuplex(USART_TypeDef *p_lpuart)
{
  STM32_SET_BIT(p_lpuart->CR3, USART_CR3_HDSEL);
}

/**
  * @brief  Disable single wire half-duplex mode.
  * @rmtoll
  *  CR3          HDSEL         LL_LPUART_DisableHalfDuplex
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableHalfDuplex(USART_TypeDef *p_lpuart)
{
  STM32_CLEAR_BIT(p_lpuart->CR3, USART_CR3_HDSEL);
}

/**
  * @brief  Indicate if single wire half-duplex mode is enabled.
  * @rmtoll
  *  CR3          HDSEL         LL_LPUART_IsEnabledHalfDuplex
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledHalfDuplex(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR3, USART_CR3_HDSEL) == (USART_CR3_HDSEL)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup LPUART_LL_EF_Configuration_DE Configuration functions related to driver enable feature
  * @{
  */

/**
  * @brief  Set DEDT (Driver Enable De-Assertion Time), time value expressed on 5 bits ([4:0] bits).
  * @rmtoll
  *  CR1          DEDT          LL_LPUART_SetDEDeassertionTime
  * @param  p_lpuart LPUART Instance
  * @param  time Value between Min_Data=0 and Max_Data=31: expressed in lpuart kernel clock cycles.
  */
__STATIC_INLINE void LL_LPUART_SetDEDeassertionTime(USART_TypeDef *p_lpuart, uint32_t time)
{
  STM32_MODIFY_REG(p_lpuart->CR1, USART_CR1_DEDT, time << USART_CR1_DEDT_Pos);
}

/**
  * @brief  Return DEDT (Driver Enable De-Assertion Time).
  * @rmtoll
  *  CR1          DEDT          LL_LPUART_GetDEDeassertionTime
  * @param  p_lpuart LPUART Instance
  * @retval Time value expressed on 5 bits ([4:0] bits) : expressed in lpuart kernel clock cycles
  */
__STATIC_INLINE uint32_t LL_LPUART_GetDEDeassertionTime(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR1, USART_CR1_DEDT) >> USART_CR1_DEDT_Pos);
}

/**
  * @brief  Set DEAT (Driver Enable Assertion Time), time value expressed on 5 bits ([4:0] bits).
  * @rmtoll
  *  CR1          DEAT          LL_LPUART_SetDEAssertionTime
  * @param  p_lpuart LPUART Instance
  * @param  time Value between Min_Data=0 and Max_Data=31: expressed in lpuart kernel clock cycles.
  */
__STATIC_INLINE void LL_LPUART_SetDEAssertionTime(USART_TypeDef *p_lpuart, uint32_t time)
{
  STM32_MODIFY_REG(p_lpuart->CR1, USART_CR1_DEAT, time << USART_CR1_DEAT_Pos);
}

/**
  * @brief  Return DEAT (Driver Enable Assertion Time).
  * @rmtoll
  *  CR1          DEAT          LL_LPUART_GetDEAssertionTime
  * @param  p_lpuart LPUART Instance
  * @retval Time value expressed on 5 bits ([4:0] bits) : expressed in lpuart kernel clock cycles
  */
__STATIC_INLINE uint32_t LL_LPUART_GetDEAssertionTime(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR1, USART_CR1_DEAT) >> USART_CR1_DEAT_Pos);
}

/**
  * @brief  Enable driver enable (DE) mode.
  * @rmtoll
  *  CR3          DEM           LL_LPUART_EnableDEMode
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableDEMode(USART_TypeDef *p_lpuart)
{
  STM32_SET_BIT(p_lpuart->CR3, USART_CR3_DEM);
}

/**
  * @brief  Disable driver enable (DE) mode.
  * @rmtoll
  *  CR3          DEM           LL_LPUART_DisableDEMode
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableDEMode(USART_TypeDef *p_lpuart)
{
  STM32_CLEAR_BIT(p_lpuart->CR3, USART_CR3_DEM);
}

/**
  * @brief  Indicate if driver enable (DE) mode is enabled.
  * @rmtoll
  *  CR3          DEM           LL_LPUART_IsEnabledDEMode
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledDEMode(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR3, USART_CR3_DEM) == (USART_CR3_DEM)) ? 1UL : 0UL);
}

/**
  * @brief  Select driver enable polarity.
  * @rmtoll
  *  CR3          DEP           LL_LPUART_SetDESignalPolarity
  * @param  p_lpuart LPUART Instance
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_DE_POLARITY_HIGH
  *         @arg @ref LL_LPUART_DE_POLARITY_LOW
  */
__STATIC_INLINE void LL_LPUART_SetDESignalPolarity(USART_TypeDef *p_lpuart, uint32_t polarity)
{
  STM32_MODIFY_REG(p_lpuart->CR3, USART_CR3_DEP, polarity);
}

/**
  * @brief  Return driver enable polarity.
  * @rmtoll
  *  CR3          DEP           LL_LPUART_GetDESignalPolarity
  * @param  p_lpuart LPUART Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_LPUART_DE_POLARITY_HIGH
  *         @arg @ref LL_LPUART_DE_POLARITY_LOW
  */
__STATIC_INLINE uint32_t LL_LPUART_GetDESignalPolarity(const USART_TypeDef *p_lpuart)
{
  return (uint32_t)(STM32_READ_BIT(p_lpuart->CR3, USART_CR3_DEP));
}

/**
  * @}
  */

/** @defgroup LPUART_LL_EF_FLAG_Management FLAG_Management
  * @{
  */

/**
  * @brief  Check if the USART flag mask is set or not.
  * @rmtoll
  *  ISR          PE            LL_LPUART_IsActiveFlag \n
  *  ISR          FE            LL_LPUART_IsActiveFlag \n
  *  ISR          NE            LL_LPUART_IsActiveFlag \n
  *  ISR          ORE           LL_LPUART_IsActiveFlag \n
  *  ISR          IDLE          LL_LPUART_IsActiveFlag \n
  *  ISR          RXNE_RXFNE    LL_LPUART_IsActiveFlag \n
  *  ISR          TC            LL_LPUART_IsActiveFlag \n
  *  ISR          TXE_TXFNF     LL_LPUART_IsActiveFlag \n
  *  ISR          CTSIF         LL_LPUART_IsActiveFlag \n
  *  ISR          CTS           LL_LPUART_IsActiveFlag \n
  *  ISR          RTOF          LL_LPUART_IsActiveFlag \n
  *  ISR          ABRE          LL_LPUART_IsActiveFlag \n
  *  ISR          ABRF          LL_LPUART_IsActiveFlag \n
  *  ISR          BUSY          LL_LPUART_IsActiveFlag \n
  *  ISR          CMF           LL_LPUART_IsActiveFlag \n
  *  ISR          SBKF          LL_LPUART_IsActiveFlag \n
  *  ISR          RWU           LL_LPUART_IsActiveFlag \n
  *  ISR          WUF           LL_LPUART_IsActiveFlag \n
  *  ISR          TEACK         LL_LPUART_IsActiveFlag \n
  *  ISR          REACK         LL_LPUART_IsActiveFlag \n
  *  ISR          TXFE          LL_LPUART_IsActiveFlag \n
  *  ISR          RXFF          LL_LPUART_IsActiveFlag \n
  *  ISR          TXFT          LL_LPUART_IsActiveFlag \n
  *  ISR          RXFT          LL_LPUART_IsActiveFlag
  * @param  p_lpuart LPUART Instance
  * @param  mask Mask to test
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag(const USART_TypeDef *p_lpuart, uint32_t mask)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, mask) == (mask)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART parity error flag is set or not.
  * @rmtoll
  *  ISR          PE            LL_LPUART_IsActiveFlag_PE
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_PE(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_PE) == (USART_ISR_PE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART framing error flag is set or not.
  * @rmtoll
  *  ISR          FE            LL_LPUART_IsActiveFlag_FE
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_FE(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_FE) == (USART_ISR_FE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART noise error detected flag is set or not.
  * @rmtoll
  *  ISR          NE            LL_LPUART_IsActiveFlag_NE
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_NE(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_NE) == (USART_ISR_NE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART overrun error flag is set or not.
  * @rmtoll
  *  ISR          ORE           LL_LPUART_IsActiveFlag_ORE
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_ORE(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_ORE) == (USART_ISR_ORE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART IDLE line detected flag is set or not.
  * @rmtoll
  *  ISR          IDLE          LL_LPUART_IsActiveFlag_IDLE
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_IDLE(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_IDLE) == (USART_ISR_IDLE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART read data register or LPUART RX FIFO not empty flag is set or not.
  * @rmtoll
  *  ISR          RXNE_RXFNE    LL_LPUART_IsActiveFlag_RXNE_RXFNE
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_RXNE_RXFNE(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_RXNE_RXFNE) == (USART_ISR_RXNE_RXFNE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART transmission complete flag is set or not.
  * @rmtoll
  *  ISR          TC            LL_LPUART_IsActiveFlag_TC
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_TC(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_TC) == (USART_ISR_TC)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART transmit data register empty or LPUART TX FIFO not full flag is set or not.
  * @rmtoll
  *  ISR          TXE_TXFNF     LL_LPUART_IsActiveFlag_TXE_TXFNF
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_TXE_TXFNF(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_TXE_TXFNF) == (USART_ISR_TXE_TXFNF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART CTS interrupt flag is set or not.
  * @rmtoll
  *  ISR          CTSIF         LL_LPUART_IsActiveFlag_nCTS
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_nCTS(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_CTSIF) == (USART_ISR_CTSIF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART CTS flag is set or not.
  * @rmtoll
  *  ISR          CTS           LL_LPUART_IsActiveFlag_CTS
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_CTS(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_CTS) == (USART_ISR_CTS)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART busy flag is set or not.
  * @rmtoll
  *  ISR          BUSY          LL_LPUART_IsActiveFlag_BUSY
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_BUSY(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_BUSY) == (USART_ISR_BUSY)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART character match flag is set or not.
  * @rmtoll
  *  ISR          CMF           LL_LPUART_IsActiveFlag_CM
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_CM(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_CMF) == (USART_ISR_CMF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART send break flag is set or not.
  * @rmtoll
  *  ISR          SBKF          LL_LPUART_IsActiveFlag_SBK
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_SBK(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_SBKF) == (USART_ISR_SBKF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART receive wake-up from mute mode flag is set or not.
  * @rmtoll
  *  ISR          RWU           LL_LPUART_IsActiveFlag_RWU
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_RWU(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_RWU) == (USART_ISR_RWU)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART wake-up from stop mode flag is set or not.
  * @rmtoll
  *  ISR          WUF           LL_LPUART_IsActiveFlag_WKUP
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_WKUP(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_WUF) == (USART_ISR_WUF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART transmit enable acknowledge flag is set or not.
  * @rmtoll
  *  ISR          TEACK         LL_LPUART_IsActiveFlag_TEACK
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_TEACK(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_TEACK) == (USART_ISR_TEACK)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART receive enable acknowledge flag is set or not.
  * @rmtoll
  *  ISR          REACK         LL_LPUART_IsActiveFlag_REACK
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_REACK(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_REACK) == (USART_ISR_REACK)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART TX FIFO empty flag is set or not.
  * @rmtoll
  *  ISR          TXFE          LL_LPUART_IsActiveFlag_TXFE
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_TXFE(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_TXFE) == (USART_ISR_TXFE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART RX FIFO full flag is set or not.
  * @rmtoll
  *  ISR          RXFF          LL_LPUART_IsActiveFlag_RXFF
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_RXFF(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_RXFF) == (USART_ISR_RXFF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART TX FIFO threshold flag is set or not.
  * @rmtoll
  *  ISR          TXFT          LL_LPUART_IsActiveFlag_TXFT
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_TXFT(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_TXFT) == (USART_ISR_TXFT)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART RX FIFO threshold flag is set or not.
  * @rmtoll
  *  ISR          RXFT          LL_LPUART_IsActiveFlag_RXFT
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsActiveFlag_RXFT(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->ISR, USART_ISR_RXFT) == (USART_ISR_RXFT)) ? 1UL : 0UL);
}

/**
  * @brief  Clear the flag mask.
  * @rmtoll
  *  ISR          PE            LL_LPUART_ClearFlag \n
  *  ISR          FE            LL_LPUART_ClearFlag \n
  *  ISR          NE            LL_LPUART_ClearFlag \n
  *  ISR          ORE           LL_LPUART_ClearFlag \n
  *  ISR          IDLE          LL_LPUART_ClearFlag \n
  *  ISR          TC            LL_LPUART_ClearFlag \n
  *  ISR          CTS           LL_LPUART_ClearFlag \n
  *  ISR          RTOF          LL_LPUART_ClearFlag \n
  *  ISR          CMF           LL_LPUART_ClearFlag \n
  *  ISR          WUF           LL_LPUART_ClearFlag \n
  *  ISR          TXFE          LL_LPUART_ClearFlag \n
  * @param  p_lpuart LPUART Instance
  * @param  mask Mask to test
  */
__STATIC_INLINE void LL_LPUART_ClearFlag(USART_TypeDef *p_lpuart, uint32_t mask)
{
  STM32_WRITE_REG(p_lpuart->ICR, mask);
}

/**
  * @brief  Clear parity error flag.
  * @rmtoll
  *  ICR          PECF          LL_LPUART_ClearFlag_PE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_PE(USART_TypeDef *p_lpuart)
{
  STM32_WRITE_REG(p_lpuart->ICR, USART_ICR_PECF);
}

/**
  * @brief  Clear framing error flag.
  * @rmtoll
  *  ICR          FECF          LL_LPUART_ClearFlag_FE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_FE(USART_TypeDef *p_lpuart)
{
  STM32_WRITE_REG(p_lpuart->ICR, USART_ICR_FECF);
}

/**
  * @brief  Clear noise detected flag.
  * @rmtoll
  *  ICR          NECF          LL_LPUART_ClearFlag_NE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_NE(USART_TypeDef *p_lpuart)
{
  STM32_WRITE_REG(p_lpuart->ICR, USART_ICR_NECF);
}

/**
  * @brief  Clear overrun error flag.
  * @rmtoll
  *  ICR          ORECF         LL_LPUART_ClearFlag_ORE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_ORE(USART_TypeDef *p_lpuart)
{
  STM32_WRITE_REG(p_lpuart->ICR, USART_ICR_ORECF);
}

/**
  * @brief  Clear IDLE line detected flag.
  * @rmtoll
  *  ICR          IDLECF        LL_LPUART_ClearFlag_IDLE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_IDLE(USART_TypeDef *p_lpuart)
{
  STM32_WRITE_REG(p_lpuart->ICR, USART_ICR_IDLECF);
}

/**
  * @brief  Clear transmission complete flag.
  * @rmtoll
  *  ICR          TCCF          LL_LPUART_ClearFlag_TC
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_TC(USART_TypeDef *p_lpuart)
{
  STM32_WRITE_REG(p_lpuart->ICR, USART_ICR_TCCF);
}

/**
  * @brief  Clear CTS interrupt flag.
  * @rmtoll
  *  ICR          CTSCF         LL_LPUART_ClearFlag_nCTS
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_nCTS(USART_TypeDef *p_lpuart)
{
  STM32_WRITE_REG(p_lpuart->ICR, USART_ICR_CTSCF);
}

/**
  * @brief  Clear character match flag.
  * @rmtoll
  *  ICR          CMCF          LL_LPUART_ClearFlag_CM
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_CM(USART_TypeDef *p_lpuart)
{
  STM32_WRITE_REG(p_lpuart->ICR, USART_ICR_CMCF);
}

/**
  * @brief  Clear wake-up from stop mode flag.
  * @rmtoll
  *  ICR          WUCF          LL_LPUART_ClearFlag_WKUP
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_ClearFlag_WKUP(USART_TypeDef *p_lpuart)
{
  STM32_WRITE_REG(p_lpuart->ICR, USART_ICR_WUCF);
}

/**
  * @}
  */

