MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_lpuart.h
/** @defgroup LPUART_LL_EF_IT_Management IT_Management
  * @{
  */

/**
  * @brief  Enable IDLE interrupt.
  * @rmtoll
  *  CR1          IDLEIE        LL_LPUART_EnableIT_IDLE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_IDLE(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_IDLEIE);
}

/**
  * @brief  Enable RX not empty and RX FIFO not empty interrupt.
  * @rmtoll
  *  CR1        RXNEIE_RXFNEIE  LL_LPUART_EnableIT_RXNE_RXFNE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_RXNE_RXFNE(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_RXNEIE_RXFNEIE);
}

/**
  * @brief  Enable transmission complete interrupt.
  * @rmtoll
  *  CR1          TCIE          LL_LPUART_EnableIT_TC
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_TC(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_TCIE);
}

/**
  * @brief  Enable TX empty and TX FIFO not full interrupt.
  * @rmtoll
  *  CR1         TXEIE_TXFNFIE  LL_LPUART_EnableIT_TXE_TXFNF
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_TXE_TXFNF(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_TXEIE_TXFNFIE);
}

/**
  * @brief  Enable parity error interrupt.
  * @rmtoll
  *  CR1          PEIE          LL_LPUART_EnableIT_PE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_PE(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_PEIE);
}

/**
  * @brief  Enable character match interrupt.
  * @rmtoll
  *  CR1          CMIE          LL_LPUART_EnableIT_CM
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_CM(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_CMIE);
}

/**
  * @brief  Enable TX FIFO empty interrupt.
  * @rmtoll
  *  CR1          TXFEIE        LL_LPUART_EnableIT_TXFE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_TXFE(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_TXFEIE);
}

/**
  * @brief  Enable RX FIFO full interrupt.
  * @rmtoll
  *  CR1          RXFFIE        LL_LPUART_EnableIT_RXFF
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_RXFF(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR1, USART_CR1_RXFFIE);
}

/**
  * @brief  Enable error interrupt.
  * @rmtoll
  *  CR3          EIE           LL_LPUART_EnableIT_ERROR
  * @param  p_lpuart LPUART Instance
  * @note   When set, error interrupt enable bit is enabling interrupt generation in case of a framing
  *         error, overrun error or noise flag (FE=1 or ORE=1 or NF=1 in the LPUARTx_ISR register).
  *         - 0: Interrupt is inhibited
  *         - 1: An interrupt is generated when FE=1 or ORE=1 or NF=1 in the LPUARTx_ISR register.
  */
__STATIC_INLINE void LL_LPUART_EnableIT_ERROR(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR3, USART_CR3_EIE);
}

/**
  * @brief  Enable CTS interrupt.
  * @rmtoll
  *  CR3          CTSIE         LL_LPUART_EnableIT_CTS
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_CTS(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR3, USART_CR3_CTSIE);
}

/**
  * @brief  Enable wake-up from stop mode interrupt.
  * @rmtoll
  *  CR3          WUFIE         LL_LPUART_EnableIT_WKUP
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_WKUP(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR3, USART_CR3_WUFIE);
}

/**
  * @brief  Enable TX FIFO threshold interrupt.
  * @rmtoll
  *  CR3          TXFTIE        LL_LPUART_EnableIT_TXFT
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_TXFT(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR3, USART_CR3_TXFTIE);
}

/**
  * @brief  Enable RX FIFO threshold interrupt.
  * @rmtoll
  *  CR3          RXFTIE        LL_LPUART_EnableIT_RXFT
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableIT_RXFT(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR3, USART_CR3_RXFTIE);
}

/**
  * @brief  Disable IDLE interrupt.
  * @rmtoll
  *  CR1          IDLEIE        LL_LPUART_DisableIT_IDLE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_IDLE(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_IDLEIE);
}

/**
  * @brief  Disable RX not empty and RX FIFO not empty interrupt.
  * @rmtoll
  *  CR1        RXNEIE_RXFNEIE  LL_LPUART_DisableIT_RXNE_RXFNE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_RXNE_RXFNE(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_RXNEIE_RXFNEIE);
}

/**
  * @brief  Disable transmission complete interrupt.
  * @rmtoll
  *  CR1          TCIE          LL_LPUART_DisableIT_TC
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_TC(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_TCIE);
}

/**
  * @brief  Disable TX empty and TX FIFO not full interrupt.
  * @rmtoll
  *  CR1        TXEIE_TXFNFIE  LL_LPUART_DisableIT_TXE_TXFNF
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_TXE_TXFNF(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_TXEIE_TXFNFIE);
}

/**
  * @brief  Disable parity error interrupt.
  * @rmtoll
  *  CR1          PEIE          LL_LPUART_DisableIT_PE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_PE(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_PEIE);
}

/**
  * @brief  Disable character match interrupt.
  * @rmtoll
  *  CR1          CMIE          LL_LPUART_DisableIT_CM
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_CM(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_CMIE);
}

/**
  * @brief  Disable TX FIFO empty interrupt.
  * @rmtoll
  *  CR1          TXFEIE        LL_LPUART_DisableIT_TXFE
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_TXFE(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_TXFEIE);
}

/**
  * @brief  Disable RX FIFO full interrupt.
  * @rmtoll
  *  CR1          RXFFIE        LL_LPUART_DisableIT_RXFF
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_RXFF(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR1, USART_CR1_RXFFIE);
}

/**
  * @brief  Disable error interrupt.
  * @rmtoll
  *  CR3          EIE           LL_LPUART_DisableIT_ERROR
  * @param  p_lpuart LPUART Instance
  * @note   When set, error interrupt enable bit is enabling interrupt generation in case of a framing
  *         error, overrun error or noise flag (FE=1 or ORE=1 or NF=1 in the LPUARTx_ISR register).
  *         - 0: Interrupt is inhibited
  *         - 1: An interrupt is generated when FE=1 or ORE=1 or NF=1 in the LPUARTx_ISR register.
  */
__STATIC_INLINE void LL_LPUART_DisableIT_ERROR(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR3, USART_CR3_EIE);
}

/**
  * @brief  Disable CTS interrupt.
  * @rmtoll
  *  CR3          CTSIE         LL_LPUART_DisableIT_CTS
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_CTS(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR3, USART_CR3_CTSIE);
}

/**
  * @brief  Disable wake-up from stop mode interrupt.
  * @rmtoll
  *  CR3          WUFIE         LL_LPUART_DisableIT_WKUP
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_WKUP(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR3, USART_CR3_WUFIE);
}

/**
  * @brief  Disable TX FIFO threshold interrupt.
  * @rmtoll
  *  CR3          TXFTIE        LL_LPUART_DisableIT_TXFT
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_TXFT(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR3, USART_CR3_TXFTIE);
}

/**
  * @brief  Disable RX FIFO threshold interrupt.
  * @rmtoll
  *  CR3          RXFTIE        LL_LPUART_DisableIT_RXFT
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableIT_RXFT(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR3, USART_CR3_RXFTIE);
}

/**
  * @brief  Check if the LPUART IDLE interrupt source is enabled or disabled.
  * @rmtoll
  *  CR1          IDLEIE        LL_LPUART_IsEnabledIT_IDLE
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_IDLE(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_IDLEIE) == (USART_CR1_IDLEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART RX not empty and LPUART RX FIFO not empty interrupt is enabled or disabled.
  * @rmtoll
  *  CR1        RXNEIE_RXFNEIE  LL_LPUART_IsEnabledIT_RXNE_RXFNE
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_RXNE_RXFNE(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_RXNEIE_RXFNEIE) == (USART_CR1_RXNEIE_RXFNEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART transmission complete interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          TCIE          LL_LPUART_IsEnabledIT_TC
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_TC(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_TCIE) == (USART_CR1_TCIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART TX empty and LPUART TX FIFO not full interrupt is enabled or disabled.
  * @rmtoll
  *  CR1         TXEIE_TXFNFIE  LL_LPUART_IsEnabledIT_TXE_TXFNF
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_TXE_TXFNF(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_TXEIE_TXFNFIE) == (USART_CR1_TXEIE_TXFNFIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART parity error interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          PEIE          LL_LPUART_IsEnabledIT_PE
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_PE(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_PEIE) == (USART_CR1_PEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART character match interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          CMIE          LL_LPUART_IsEnabledIT_CM
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_CM(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_CMIE) == (USART_CR1_CMIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART TX FIFO empty interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          TXFEIE        LL_LPUART_IsEnabledIT_TXFE
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_TXFE(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_TXFEIE) == (USART_CR1_TXFEIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART RX FIFO full interrupt is enabled or disabled.
  * @rmtoll
  *  CR1          RXFFIE        LL_LPUART_IsEnabledIT_RXFF
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_RXFF(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR1, USART_CR1_RXFFIE) == (USART_CR1_RXFFIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART error interrupt is enabled or disabled.
  * @rmtoll
  *  CR3          EIE           LL_LPUART_IsEnabledIT_ERROR
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_ERROR(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR3, USART_CR3_EIE) == (USART_CR3_EIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART CTS interrupt is enabled or disabled.
  * @rmtoll
  *  CR3          CTSIE         LL_LPUART_IsEnabledIT_CTS
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_CTS(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR3, USART_CR3_CTSIE) == (USART_CR3_CTSIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the LPUART wake-up from stop mode interrupt is enabled or disabled.
  * @rmtoll
  *  CR3          WUFIE         LL_LPUART_IsEnabledIT_WKUP
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_WKUP(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR3, USART_CR3_WUFIE) == (USART_CR3_WUFIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if LPUART TX FIFO threshold interrupt is enabled or disabled.
  * @rmtoll
  *  CR3          TXFTIE        LL_LPUART_IsEnabledIT_TXFT
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_TXFT(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR3, USART_CR3_TXFTIE) == (USART_CR3_TXFTIE)) ? 1UL : 0UL);
}

/**
  * @brief  Check if LPUART RX FIFO threshold interrupt is enabled or disabled.
  * @rmtoll
  *  CR3          RXFTIE        LL_LPUART_IsEnabledIT_RXFT
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledIT_RXFT(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR3, USART_CR3_RXFTIE) == (USART_CR3_RXFTIE)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup LPUART_LL_EF_DMA_Management DMA_Management
  * @{
  */

/**
  * @brief  Enable DMA mode for reception.
  * @rmtoll
  *  CR3          DMAR          LL_LPUART_EnableDMAReq_RX
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableDMAReq_RX(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR3, USART_CR3_DMAR);
}

/**
  * @brief  Disable DMA mode for reception.
  * @rmtoll
  *  CR3          DMAR          LL_LPUART_DisableDMAReq_RX
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableDMAReq_RX(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR3, USART_CR3_DMAR);
}

/**
  * @brief  Check if DMA mode is enabled for reception.
  * @rmtoll
  *  CR3          DMAR          LL_LPUART_IsEnabledDMAReq_RX
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledDMAReq_RX(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR3, USART_CR3_DMAR) == (USART_CR3_DMAR)) ? 1UL : 0UL);
}

/**
  * @brief  Enable DMA mode for transmission.
  * @rmtoll
  *  CR3          DMAT          LL_LPUART_EnableDMAReq_TX
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableDMAReq_TX(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_SET_BIT_32(p_lpuart->CR3, USART_CR3_DMAT);
}

/**
  * @brief  Disable DMA mode for transmission.
  * @rmtoll
  *  CR3          DMAT          LL_LPUART_DisableDMAReq_TX
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableDMAReq_TX(USART_TypeDef *p_lpuart)
{
  STM32_ATOMIC_CLEAR_BIT_32(p_lpuart->CR3, USART_CR3_DMAT);
}

/**
  * @brief  Check if DMA mode is enabled for transmission.
  * @rmtoll
  *  CR3          DMAT          LL_LPUART_IsEnabledDMAReq_TX
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledDMAReq_TX(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR3, USART_CR3_DMAT) == (USART_CR3_DMAT)) ? 1UL : 0UL);
}

/**
  * @brief  Enable DMA disabling on reception error.
  * @rmtoll
  *  CR3          DDRE          LL_LPUART_EnableDMADeactOnRxErr
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_EnableDMADeactOnRxErr(USART_TypeDef *p_lpuart)
{
  STM32_SET_BIT(p_lpuart->CR3, USART_CR3_DDRE);
}

/**
  * @brief  Disable DMA disabling on reception error.
  * @rmtoll
  *  CR3          DDRE          LL_LPUART_DisableDMADeactOnRxErr
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_DisableDMADeactOnRxErr(USART_TypeDef *p_lpuart)
{
  STM32_CLEAR_BIT(p_lpuart->CR3, USART_CR3_DDRE);
}

/**
  * @brief  Indicate if DMA disabling on reception error is disabled.
  * @rmtoll
  *  CR3          DDRE          LL_LPUART_IsEnabledDMADeactOnRxErr
  * @param  p_lpuart LPUART Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_LPUART_IsEnabledDMADeactOnRxErr(const USART_TypeDef *p_lpuart)
{
  return ((STM32_READ_BIT(p_lpuart->CR3, USART_CR3_DDRE) == (USART_CR3_DDRE)) ? 1UL : 0UL);
}

/**
  * @brief  Get the LPUART data register address used for DMA transfer.
  * @rmtoll
  *  RDR          RDR           LL_LPUART_DMA_GetRegAddr \n
  *  TDR          TDR           LL_LPUART_DMA_GetRegAddr
  * @param  p_lpuart LPUART Instance
  * @param  direction This parameter can be one of the following values:
  *         @arg @ref LL_LPUART_DMA_REG_DATA_TRANSMIT
  *         @arg @ref LL_LPUART_DMA_REG_DATA_RECEIVE
  * @retval Address of data register
  */
__STATIC_INLINE uint32_t LL_LPUART_DMA_GetRegAddr(const USART_TypeDef *p_lpuart, uint32_t direction)
{
  uint32_t data_reg_addr;

  if (direction == LL_LPUART_DMA_REG_DATA_TRANSMIT)
  {
    /* Return address of TDR register. */
    data_reg_addr = (uint32_t) &(p_lpuart->TDR);
  }
  else
  {
    /* Return address of RDR register. */
    data_reg_addr = (uint32_t) &(p_lpuart->RDR);
  }

  return data_reg_addr;
}

/**
  * @}
  */

/** @defgroup LPUART_LL_EF_Data_Management Data_Management
  * @{
  */

/**
  * @brief  Read receiver data register (receive data value, 8 bits).
  * @rmtoll
  *  RDR          RDR           LL_LPUART_ReceiveData8
  * @param  p_lpuart LPUART Instance
  * @retval Time value between Min_Data=0x00 and Max_Data=0xFF.
  */
__STATIC_INLINE uint8_t LL_LPUART_ReceiveData8(const USART_TypeDef *p_lpuart)
{
  return (uint8_t)(STM32_READ_BIT(p_lpuart->RDR, USART_RDR_RDR) & 0xFFU);
}

/**
  * @brief  Read receiver data register (receive data value, 9 bits).
  * @rmtoll
  *  RDR          RDR           LL_LPUART_ReceiveData9
  * @param  p_lpuart LPUART Instance
  * @retval Time value between Min_Data=0x00 and Max_Data=0x1FF.
  */
__STATIC_INLINE uint16_t LL_LPUART_ReceiveData9(const USART_TypeDef *p_lpuart)
{
  return (uint16_t)(STM32_READ_BIT(p_lpuart->RDR, USART_RDR_RDR));
}

/**
  * @brief  Write in transmitter data register (transmit data value, 8 bits).
  * @rmtoll
  *  TDR          TDR           LL_LPUART_TransmitData8
  * @param  p_lpuart LPUART Instance
  * @param  value Value between Min_Data=0x00 and Max_Data=0xFF.
  */
__STATIC_INLINE void LL_LPUART_TransmitData8(USART_TypeDef *p_lpuart, uint8_t value)
{
  p_lpuart->TDR = value;
}

/**
  * @brief  Write in transmitter data register (transmit data value, 9 bits).
  * @rmtoll
  *  TDR          TDR           LL_LPUART_TransmitData9
  * @param  p_lpuart LPUART Instance
  * @param  value Value between Min_Data=0x00 and Max_Data=0x1FF.
  */
__STATIC_INLINE void LL_LPUART_TransmitData9(USART_TypeDef *p_lpuart, uint16_t value)
{
  p_lpuart->TDR = value & 0x1FFUL;
}

/**
  * @}
  */

/** @defgroup LPUART_LL_EF_Execution Execution
  * @{
  */
/**
  * @brief  Set a request.
  * @rmtoll
  *  RQR          SBKRQ         LL_LPUART_SetRequest \n
  *  RQR          MMRQ          LL_LPUART_SetRequest \n
  *  RQR          RXFRQ         LL_LPUART_SetRequest \n
  *  RQR          TXFRQ         LL_LPUART_SetRequest
  * @param  p_lpuart LPUART Instance
  * @param  request Request to set
  *         @arg @ref LL_LPUART_REQUEST_SEND_BREAK
  *         @arg @ref LL_LPUART_REQUEST_MUTE_MODE
  *         @arg @ref LL_LPUART_REQUEST_RXDATA_FLUSH
  *         @arg @ref LL_LPUART_REQUEST_TXDATA_FLUSH
  */
__STATIC_INLINE void LL_LPUART_SetRequest(USART_TypeDef *p_lpuart, uint16_t request)
{
  STM32_SET_BIT(p_lpuart->RQR, request);
}

/**
  * @brief  Request break sending.
  * @rmtoll
  *  RQR          SBKRQ         LL_LPUART_RequestBreakSending
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_RequestBreakSending(USART_TypeDef *p_lpuart)
{
  STM32_SET_BIT(p_lpuart->RQR, (uint16_t)USART_RQR_SBKRQ);
}

/**
  * @brief  Put LPUART in mute mode and set the RWU flag.
  * @rmtoll
  *  RQR          MMRQ          LL_LPUART_RequestEnterMuteMode
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_RequestEnterMuteMode(USART_TypeDef *p_lpuart)
{
  STM32_SET_BIT(p_lpuart->RQR, (uint16_t)USART_RQR_MMRQ);
}

/**
  * @brief  Request a receive data and FIFO flush.
  * @rmtoll
  *  RQR          RXFRQ         LL_LPUART_RequestRxDataFlush
  * @param  p_lpuart LPUART Instance
  * @note   Allows you to discard the received data without reading them and avoid an overrun
  *         condition.
  */
__STATIC_INLINE void LL_LPUART_RequestRxDataFlush(USART_TypeDef *p_lpuart)
{
  STM32_SET_BIT(p_lpuart->RQR, (uint16_t)USART_RQR_RXFRQ);
}

/**
  * @brief  Request a transmit data and FIFO flush.
  * @rmtoll
  *  RQR          TXFRQ         LL_LPUART_RequestTxDataFlush
  * @param  p_lpuart LPUART Instance
  */
__STATIC_INLINE void LL_LPUART_RequestTxDataFlush(USART_TypeDef *p_lpuart)
{
  STM32_SET_BIT(p_lpuart->RQR, (uint16_t)USART_RQR_TXFRQ);
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#endif /* LPUART1 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32C5XX_LL_LPUART_H */

